Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_sd.h
/** @defgroup SD_Exported_Constansts_Group2 SD context enumeration
  * @{
  */ 
#define SD_CONTEXT_NONE                 ((uint32_t)0x00000000U)  /*!< None                             */
#define SD_CONTEXT_READ_SINGLE_BLOCK    ((uint32_t)0x00000001U)  /*!< Read single block operation      */
#define SD_CONTEXT_READ_MULTIPLE_BLOCK  ((uint32_t)0x00000002U)  /*!< Read multiple blocks operation   */
#define SD_CONTEXT_WRITE_SINGLE_BLOCK   ((uint32_t)0x00000010U)  /*!< Write single block operation     */
#define SD_CONTEXT_WRITE_MULTIPLE_BLOCK ((uint32_t)0x00000020U)  /*!< Write multiple blocks operation  */
#define SD_CONTEXT_IT                   ((uint32_t)0x00000008U)  /*!< Process in Interrupt mode        */
#define SD_CONTEXT_DMA                  ((uint32_t)0x00000080U)  /*!< Process in DMA mode              */

/**
  * @}
  */

/** @defgroup SD_Exported_Constansts_Group3 SD Supported Memory Cards
  * @{
  */
#define CARD_SDSC                  ((uint32_t)0x00000000U)  /*!< SD Standard Capacity <2Go                          */
#define CARD_SDHC_SDXC             ((uint32_t)0x00000001U)  /*!< SD High Capacity <32Go, SD Extended Capacity <2To  */
#define CARD_SECURED               ((uint32_t)0x00000003U)
    
/**
  * @}
  */

/** @defgroup SD_Exported_Constansts_Group4 SD Supported Version
  * @{
  */
#define CARD_V1_X                  ((uint32_t)0x00000000U)
#define CARD_V2_X                  ((uint32_t)0x00000001U)
/**
  * @}
  */
      
/**
  * @}
  */
  
/* Exported macro ------------------------------------------------------------*/
/** @defgroup SD_Exported_macros SD Exported Macros
 *  @brief macros to handle interrupts and specific clock configurations
 * @{
 */
/** @brief Reset SD handle state.
  * @param  __HANDLE__ : SD handle.
  * @retval None
  */
#if defined (USE_HAL_SD_REGISTER_CALLBACKS) && (USE_HAL_SD_REGISTER_CALLBACKS == 1U)
#define __HAL_SD_RESET_HANDLE_STATE(__HANDLE__)           do {                                              \
                                                               (__HANDLE__)->State = HAL_SD_STATE_RESET; \
                                                               (__HANDLE__)->MspInitCallback = NULL;       \
                                                               (__HANDLE__)->MspDeInitCallback = NULL;     \
                                                             } while(0)
#else
#define __HAL_SD_RESET_HANDLE_STATE(__HANDLE__)           ((__HANDLE__)->State = HAL_SD_STATE_RESET)
#endif /* USE_HAL_SD_REGISTER_CALLBACKS */
 
/**
  * @brief  Enable the SD device.
  * @retval None
  */ 
#define __HAL_SD_ENABLE(__HANDLE__) __SDIO_ENABLE((__HANDLE__)->Instance)

/**
  * @brief  Disable the SD device.
  * @retval None
  */
#define __HAL_SD_DISABLE(__HANDLE__) __SDIO_DISABLE((__HANDLE__)->Instance)

/**
  * @brief  Enable the SDMMC DMA transfer.
  * @retval None
  */ 
#define __HAL_SD_DMA_ENABLE(__HANDLE__) __SDIO_DMA_ENABLE((__HANDLE__)->Instance)

/**
  * @brief  Disable the SDMMC DMA transfer.
  * @retval None
  */
#define __HAL_SD_DMA_DISABLE(__HANDLE__)  __SDIO_DMA_DISABLE((__HANDLE__)->Instance)
 
/**
  * @brief  Enable CMD pullup.
  * @retval None
  */ 
#define __HAL_SD_OD_PULLUP_ENABLE(__HANDLE__)  __SDIO_OD_PULLUP_ENABLE((__HANDLE__)->Instance)

/**
  * @brief  Disable CMD pullup.
  * @retval None
  */    
#define __HAL_SD_OD_PULLUP_DISABLE(__HANDLE__)  __SDIO_OD_PULLUP_DISABLE((__HANDLE__)->Instance) 

/**
  * @brief  Enable SDIO global interrupt.
  * @retval None
  */
#define __HAL_SD_ENABLE_GLOBAL_IT(__HANDLE__)  __SDIO_ENABLE_GLOBAL_IT((__HANDLE__)->Instance)

/**
  * @brief  Disable SDIO global interrupt.
  * @retval None
  */
#define __HAL_SD_DISABLE_GLOBAL_IT(__HANDLE__)  __SDIO_DISABLE_GLOBAL_IT((__HANDLE__)->Instance)

/**
  * @brief  Whether FIFO is empty.
  * @retval None
  */
#define __HAL_SD_IS_FIFO_EMPTY(__HANDLE__)  __SDIO_IS_FIFO_EMPTY((__HANDLE__)->Instance)

/**
  * @brief  Whether FIFO is full. 
  * @retval None
  */
#define __HAL_SD_IS_FIFO_FULL(__HANDLE__)  __SDIO_IS_FIFO_FULL((__HANDLE__)->Instance)

/**
  * @brief  Enable the SD device interrupt.
  * @param  __HANDLE__: SD Handle  
  * @param  __INTERRUPT__: specifies the SDMMC interrupt sources to be enabled.
  *         This parameter can be one or a combination of the following values:
  *            @arg SDIO_IT_CAD:      Card detect interrupt
  *            @arg SDIO_IT_RE:       Response error interrupt
  *            @arg SDIO_IT_CD:       Command completion interrupt
  *            @arg SDIO_IT_DTO:      Data transfer completion interrupt
  *            @arg SDIO_IT_TXDR:     Transmit FIFO request interrupt
  *            @arg SDIO_IT_RXDR:     Received FIFO request interrupt
  *            @arg SDIO_IT_RCRC:     Command response CRC check error interrupt
  *            @arg SDIO_IT_DCRC:     Data CRC check error interrupt
  *            @arg SDIO_IT_RTO_BAR:  Command response timeout interrupt
  *            @arg SDIO_IT_DRTO_BDS: Data timeout interrupt
  *            @arg SDIO_IT_HTO:      Host timeout interrupt
  *            @arg SDIO_IT_FRUN:     FIFO underrun interrupt
  *            @arg SDIO_IT_HLE:      Hardware lock write interrupt
  *            @arg SDIO_IT_SBE:      Start bit error interrupt
  *            @arg SDIO_IT_ACD:      Automatic command completion interrupt
  *            @arg SDIO_IT_EBE:      End bit error interrupt
  *            @arg SDIO_IT_SDIOINT:  Detect SDIO card interrupt
  * @retval None
  */
#define __HAL_SD_ENABLE_IT(__HANDLE__, __INTERRUPT__) __SDIO_ENABLE_IT((__HANDLE__)->Instance, (__INTERRUPT__))

/**
  * @brief  Disable the SD device interrupt.
  * @param  __HANDLE__: SD Handle   
  * @param  __INTERRUPT__: specifies the SDMMC interrupt sources to be disabled.
  *          This parameter can be one or a combination of the following values:
  *            @arg SDIO_IT_CAD:      Card detect interrupt
  *            @arg SDIO_IT_RE:       Response error interrupt
  *            @arg SDIO_IT_CD:       Command completion interrupt
  *            @arg SDIO_IT_DTO:      Data transfer completion interrupt
  *            @arg SDIO_IT_TXDR:     Transmit FIFO request interrupt
  *            @arg SDIO_IT_RXDR:     Received FIFO request interrupt
  *            @arg SDIO_IT_RCRC:     Command response CRC check error interrupt
  *            @arg SDIO_IT_DCRC:     Data CRC check error interrupt
  *            @arg SDIO_IT_RTO_BAR:  Command response timeout interrupt
  *            @arg SDIO_IT_DRTO_BDS: Data timeout interrupt
  *            @arg SDIO_IT_HTO:      Host timeout interrupt
  *            @arg SDIO_IT_FRUN:     FIFO underrun interrupt
  *            @arg SDIO_IT_HLE:      Hardware lock write interrupt
  *            @arg SDIO_IT_SBE:      Start bit error interrupt
  *            @arg SDIO_IT_ACD:      Automatic command completion interrupt
  *            @arg SDIO_IT_EBE:      End bit error interrupt
  *            @arg SDIO_IT_SDIOINT:  Detect SDIO card interrupt
  * @retval None
  */
#define __HAL_SD_DISABLE_IT(__HANDLE__, __INTERRUPT__) __SDIO_DISABLE_IT((__HANDLE__)->Instance, (__INTERRUPT__))

/**
  * @brief  Check whether the specified SD flag is set or not. 
  * @param  __HANDLE__: SD Handle   
  * @param  __FLAG__: specifies the flag to check. 
  *          This parameter can be one of the following values:
  *            @arg SDIO_FLAG_CAD:      Card detect interrupt
  *            @arg SDIO_FLAG_RE:       Response error interrupt
  *            @arg SDIO_FLAG_CD:       Command completion interrupt
  *            @arg SDIO_FLAG_DTO:      Data transfer completion interrupt
  *            @arg SDIO_FLAG_TXDR:     Transmit FIFO request interrupt
  *            @arg SDIO_FLAG_RXDR:     Received FIFO request interrupt
  *            @arg SDIO_FLAG_RCRC:     Command response CRC check error interrupt
  *            @arg SDIO_FLAG_DCRC:     Data CRC check error interrupt
  *            @arg SDIO_FLAG_RTO_BAR:  Command response timeout interrupt
  *            @arg SDIO_FLAG_DRTO_BDS: Data timeout interrupt
  *            @arg SDIO_FLAG_HTO:      Host timeout interrupt
  *            @arg SDIO_FLAG_FRUN:     FIFO underrun interrupt
  *            @arg SDIO_FLAG_HLE:      Hardware lock write interrupt
  *            @arg SDIO_FLAG_SBE:      Start bit error interrupt
  *            @arg SDIO_FLAG_ACD:      Automatic command completion interrupt
  *            @arg SDIO_FLAG_EBE:      End bit error interrupt
  *            @arg SDIO_FLAG_SDIOINT:  Detect SDIO card interrupt
  * @retval The new state of SD FLAG (SET or RESET).
  */
#define __HAL_SD_GET_FLAG(__HANDLE__, __FLAG__) __SDIO_GET_FLAG((__HANDLE__)->Instance, (__FLAG__))

/**
  * @brief  Clear the SD's pending flags.
  * @param  __HANDLE__: SD Handle  
  * @param  __FLAG__: specifies the flag to clear.  
  *          This parameter can be one or a combination of the following values:
  *            @arg SDIO_FLAG_CAD:      Card detect interrupt
  *            @arg SDIO_FLAG_RE:       Response error interrupt
  *            @arg SDIO_FLAG_CD:       Command completion interrupt
  *            @arg SDIO_FLAG_DTO:      Data transfer completion interrupt
  *            @arg SDIO_FLAG_TXDR:     Transmit FIFO request interrupt
  *            @arg SDIO_FLAG_RXDR:     Received FIFO request interrupt
  *            @arg SDIO_FLAG_RCRC:     Command response CRC check error interrupt
  *            @arg SDIO_FLAG_DCRC:     Data CRC check error interrupt
  *            @arg SDIO_FLAG_RTO_BAR:  Command response timeout interrupt
  *            @arg SDIO_FLAG_DRTO_BDS: Data timeout interrupt
  *            @arg SDIO_FLAG_HTO:      Host timeout interrupt
  *            @arg SDIO_FLAG_FRUN:     FIFO underrun interrupt
  *            @arg SDIO_FLAG_HLE:      Hardware lock write interrupt
  *            @arg SDIO_FLAG_SBE:      Start bit error interrupt
  *            @arg SDIO_FLAG_ACD:      Automatic command completion interrupt
  *            @arg SDIO_FLAG_EBE:      End bit error interrupt
  *            @arg SDIO_FLAG_SDIOINT:  Detect SDIO card interrupt
  * @retval None
  */
#define __HAL_SD_CLEAR_FLAG(__HANDLE__, __FLAG__) __SDIO_CLEAR_FLAG((__HANDLE__)->Instance, (__FLAG__))

/**
  * @}
  */
  
/* Exported functions --------------------------------------------------------*/
/** @defgroup SD_Exported_Functions SD Exported Functions
  * @{
  */
  
/** @defgroup SD_Exported_Functions_Group1 Initialization and de-initialization functions
  * @{
  */
HAL_StatusTypeDef HAL_SD_Init(SD_HandleTypeDef *hsd);
HAL_StatusTypeDef HAL_SD_InitCard(SD_HandleTypeDef *hsd);
HAL_StatusTypeDef HAL_SD_DeInit(SD_HandleTypeDef *hsd);
void HAL_SD_MspInit(SD_HandleTypeDef *hsd);
void HAL_SD_MspDeInit(SD_HandleTypeDef *hsd);
/**
  * @}
  */
  
